#include <iostream>
#include <vector>

// Найти количество разбиений числа на различные слагаемые. (диаграмма Юнга)

int run(int n) {
    std::vector<int> dp(n);
    
}

int main() {
    int n;
    std::cin >> n;
    std::cout << run(n);
}
